Tekla Open API Reference for Tekla Structures 2025
PolyBeam.PolyBeamTypeEnum Enumeration
 The polybeam types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum PolyBeamTypeEnum
Public Enumeration PolyBeamTypeEnum
Members
Member name | Value | Description
BEAM | 0 |  The polybeam.
PANEL | 1 |  The panel.
STRIP_FOOTING | 2 |  The strip footing.
COLUMN | 3 |  The column.
See Also
Reference
Tekla.Structures.Model Namespace